int/resources/objectRepo/xmlTemplates/opera/ProfileConfig/req_CreateTemplatePreferences.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateTemplatePreferencesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:TemplatePreferences>
            <v91:TemplatePreference Code="?" Housekeeping="?" OrderSequence="?" PreferenceGroup="?" PreferenceSubGroup="?">
               <v91:Description/>
               <v91:Global/>
            </v91:TemplatePreference>
         </v9:TemplatePreferences>
      </v9:CreateTemplatePreferencesRQ>
   </soapenv:Body>
</soapenv:Envelope>